---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Viewport
source: html/6c94a491-60e6-d598-5c0b-1cb08468e655.htm
---
# Viewport Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.